/*Задача 1. Сумма трех чисел
Ввести три числа, найти их сумму
Нужно напечатать сумму трех чисел

Данные на входе: Три целых числа через пробел
Данные на выходе: Строка вида %d+%d+%d=%d

Пример №1:
Данные на входе: 4 5 7
Данные на выходе: 4+5+7=16
*/

#include <stdio.h>

int main(int argc, char **argv)
{
	int a = 4;
	int b = 5;
	int c = 7;
	int x = a + b + c;
	printf("%d+%d+%d=%d", a, b, c, x);
	return 0;
}
